wosayttn/M55M1BSP/_CUnit/spim/spim_cunit.c
/**************************************************************************//**
 * @file     spim_cunit.c
 * @version  V1.00
 * $Revision: 1 $
 * $Date: 15/09/15 4:36p $
 * @brief    NUC4xx series SPIM CUnit test function.
 *
 * @note
 * Copyright (C) 2016 Nuvoton Technology Corp. All rights reserved.
 *****************************************************************************/

//* Includes ------------------------------------------------------------------*/
#include <stdio.h>
#include <stdlib.h>
#include "assert.h"

#include "NuMicro.h"
#include "CUnit.h"
#include "Console.h"
#include "spim_cunit.h"
#include "hyper_cunit.h"
#include "common.h"

//------------------------------------------------------------------------------
extern unsigned int STATE0;
extern unsigned int STATE1;
extern unsigned int ERR_STATE0;
extern unsigned int ERR_STATE1;

//------------------------------------------------------------------------------
static uint8_t idBuf[3] = {0};

/* 0x02 : CMD_NORMAL_PAGE_PROGRAM Command Phase Table */
static PHASE_SET_T gWB_02h_WrCMD =
{
    CMD_NORMAL_PAGE_PROGRAM,                                //Command Code
    PHASE_NORMAL_MODE, PHASE_WIDTH_8,  PHASE_DISABLE_DTR,       //Command Phase
    PHASE_NORMAL_MODE, PHASE_WIDTH_24, PHASE_DISABLE_DTR,       //Address Phase
    PHASE_NORMAL_MODE, PHASE_ORDER_MODE0,  PHASE_DISABLE_DTR,   //Data Phase
    0,
};

/* 0xED: CMD_DMA_FAST_QUAD_DTR_READ Command Phase Table */
static PHASE_SET_T gWB_EDh_RdCMD =
{
    CMD_DMA_FAST_QUAD_DTR_READ,                                            // Command Code
    PHASE_NORMAL_MODE, PHASE_WIDTH_8, PHASE_DISABLE_DTR,                       // Command Phase
    PHASE_QUAD_MODE, PHASE_WIDTH_24, PHASE_ENABLE_DTR,                         // Address Phase
    PHASE_QUAD_MODE, PHASE_ORDER_MODE0, PHASE_ENABLE_DTR,                      // Data Phase
    7,                                                                     // Dummy Cycle Phase
    PHASE_ENABLE_CONT_READ, PHASE_QUAD_MODE, PHASE_WIDTH_8, PHASE_ENABLE_DTR,  // Read Mode Phase
};

/* 0x03: CMD_DMA_NORMAL_READ Command Phase Table */
static PHASE_SET_T gWB_03h_RdCMD =
{
    CMD_DMA_NORMAL_READ,                                 // Command Code
    PHASE_NORMAL_MODE, PHASE_WIDTH_8, PHASE_DISABLE_DTR,     // Command Phase
    PHASE_NORMAL_MODE, PHASE_WIDTH_24, PHASE_DISABLE_DTR,    // Address Phase
    PHASE_NORMAL_MODE, PHASE_ORDER_MODE0, PHASE_DISABLE_DTR, // Data Phase
    0,                                                   // Dummy Cycle Phase
};


/* 0xEB: CMD_DMA_FAST_QUAD_READ Command Phase Table */
static PHASE_SET_T gWB_EBh_RdCMD =
{
    CMD_DMA_FAST_QUAD_READ,                                                 // Command Code
    PHASE_NORMAL_MODE, PHASE_WIDTH_8, PHASE_DISABLE_DTR,                        // Command Phase
    PHASE_QUAD_MODE, PHASE_WIDTH_24, PHASE_DISABLE_DTR,                         // Address Phase
    PHASE_QUAD_MODE, PHASE_ORDER_MODE0, PHASE_DISABLE_DTR,                      // Data Phase
    4,                                                                      // Dummy Cycle Phase
    PHASE_ENABLE_CONT_READ, PHASE_QUAD_MODE, PHASE_WIDTH_8, PHASE_DISABLE_DTR,  // Read Mode Phase
};

/*----------------------------------------------------------------------------*/
/* Test function                                                              */
/*----------------------------------------------------------------------------*/
void SPIMIrqHandle(SPIM_T *spim)
{
    printf("INT!\n");

    CU_ASSERT_TRUE((spim->CTL0 & SPIM_CTL0_IF_Msk));

    SPIM_CLR_INT(spim);

    CU_ASSERT_FALSE((spim->CTL0 & SPIM_CTL0_IF_Msk));
}

void SPIM1_IRQHandler(void)
{
    SPIM_T *pSPIMModule = (SPIM_T *)GetSPIMModule(C_SPIM1);

    //printf("INT!\n");

    //CU_ASSERT_TRUE(_SPIM_IS_IF_ON());
    //_SPIM_CLR_INT();
    //CU_ASSERT_FALSE(_SPIM_IS_IF_ON());
    SPIMIrqHandle(pSPIMModule);
}

void SPIM0_IRQHandler(void)
{
    SPIM_T *pSPIMModule = (SPIM_T *)GetSPIMModule(C_SPIM0);

    //printf("INT!\n");

    //CU_ASSERT_TRUE(_SPIM_IS_IF_ON());
    //_SPIM_CLR_INT();
    //CU_ASSERT_FALSE(_SPIM_IS_IF_ON());

    SPIMIrqHandle(pSPIMModule);
}

int SPIM_Tests_Init(void)
{
    SPIM_T *pSPIMModule = NULL;

    pSPIMModule = (SPIM_T *)GetSPIMModule(GetSPIMTestModuleIdx());

    // SPIM_SET_CLOCK_DIVIDER(pSPIMModule, 10);        /* Set SPIM clock as HCLK divided by 2 */

    // SPIM_SET_RXCLKDLY_RDDLYSEL(pSPIMModule, 2);    /* Insert 0 delay cycle. Adjust the sampling clock of received data to latch the correct data. */
    // SPIM_SET_RXCLKDLY_RDEDGE(pSPIMModule);         /* Use SPI input clock rising edge to sample received data. */
    // SPIM_SET_DMAR_DC(pSPIMModule, 8);              /* Set 8 dummy cycle. */

    if (SPIM_InitFlash(pSPIMModule, 1) != 0) /* Initialized SPI flash */
    {
        printf("SPIM flash initialize failed!\n");

        while (1);
    }

    SPIM_ReadJedecId(pSPIMModule, idBuf, sizeof(idBuf), 1, 0, 0);
    printf("SPIM get JEDEC ID=0x%02X, 0x%02X, 0x%02X\n",
           idBuf[0],
           idBuf[1],
           idBuf[2]);

    return 0;
}

int SPIM_Tests_Clean(void)
{
    return 0;
}

/*----------------------------------------------------------------------------*/
/* Function: function_name                                                    */
/*                                                                            */
/* Parameters:                                                                */
/*               param - [in/out], parameter_description                      */
/*               param - [in/out], parameter_description                      */
/*                                                                            */
/* Returns:      the_value                                                    */
/* Side effects: the_effect                                                   */
/* Description:                                                               */
/*               description                                                  */
/*----------------------------------------------------------------------------*/
void spim_dma_read(SPIM_T *spim, uint32_t u32Addr, uint32_t u32NRx, uint8_t *pu8RxBuf)
{
    SPIM_SET_OPMODE(spim, SPIM_CTL0_OPMODE_PAGEREAD);// Switch to Page Read mode.

