wosayttn/M55M1BSP/_CUnit/spim/spim_cunit.c
void SPIM_Const_MFGID()
{
    CU_ASSERT(MFGID_UNKNOW == 0x00);
    CU_ASSERT(MFGID_SPANSION == 0x01);
    CU_ASSERT(MFGID_EON == 0x1C);
    CU_ASSERT(MFGID_ISSI == 0x7F);
    CU_ASSERT(MFGID_MXIC == 0xC2);
    CU_ASSERT(MFGID_WINBOND == 0xEF);
    CU_ASSERT(MFGID_MICRON == 0x2CU);
}

void SPIM_Const_OPCODE()
{
    CU_ASSERT(OPCODE_WREN == (0x06U));
    CU_ASSERT(OPCODE_RDSR == (0x05U));
    CU_ASSERT(OPCODE_WRSR == (0x01U));
    CU_ASSERT(OPCODE_RDSR2 == (0x35U));
    CU_ASSERT(OPCODE_WRSR2 == (0x31U));
    CU_ASSERT(OPCODE_RDSR3 == (0x15U));
    CU_ASSERT(OPCODE_WRSR3 == (0x11U));
    CU_ASSERT(OPCODE_PP == (0x02U));
    CU_ASSERT(OPCODE_SE_4K == (0x20U));
    CU_ASSERT(OPCODE_BE_32K == (0x52U));
    CU_ASSERT(OPCODE_CHIP_ERASE == (0xc7U));
    CU_ASSERT(OPCODE_BE_64K == (0xd8U));
    CU_ASSERT(OPCODE_READ_ID == (0x90U));
    CU_ASSERT(OPCODE_RDID == (0x9fU));
    CU_ASSERT(OPCODE_BRRD == (0x16U));
    CU_ASSERT(OPCODE_BRWR == (0x17U));
    CU_ASSERT(OPCODE_NORM_READ == (0x03U));
    CU_ASSERT(OPCODE_FAST_READ == (0x0bU));
    CU_ASSERT(OPCODE_FAST_DUAL_READ == (0x3bU));
    CU_ASSERT(OPCODE_FAST_QUAD_READ == (0x6bU));

    CU_ASSERT(OPCODE_WR_NVCONFIG == (0xB1U));
    CU_ASSERT(OPCODE_WR_VCONFIG == (0x81U));
    CU_ASSERT(OPCODE_RD_NVCONFIG == (0xB5U));
    CU_ASSERT(OPCODE_RD_VCONFIG == (0x85U));

    CU_ASSERT(OPCODE_BP == (0x02U));
    CU_ASSERT(OPCODE_WRDI == (0x04U));
    CU_ASSERT(OPCODE_AAI_WP == (0xadU));

    CU_ASSERT(OPCODE_EN4B == (0xb7U));
    CU_ASSERT(OPCODE_EX4B == (0xe9U));

    CU_ASSERT(OPCODE_RDSCUR == (0x2bU));
    CU_ASSERT(OPCODE_WRSCUR == (0x2fU));

    CU_ASSERT(OPCODE_RSTEN == (0x66U));
    CU_ASSERT(OPCODE_RST == (0x99U));

    CU_ASSERT(OPCODE_ENQPI == (0x38U));
    CU_ASSERT(OPCODE_EXQPI == (0xFFU));

    /* Used for Micron flashes. */
    CU_ASSERT(OPCODE_FAST_OCTAL_OUTPUT_READ == (0x8BU));
    CU_ASSERT(OPCODE_FAST_OCTAL_IO_READ == (0xCBU));
}

void SPIM_Const_Register()
{
    CU_ASSERT(SR_WIP == 1);
    CU_ASSERT(SR_WEL == 2);
    CU_ASSERT(SR_QE == 0x40);

    CU_ASSERT(SR2_QE == 2);

    CU_ASSERT(SR_BP0 == 4);
    CU_ASSERT(SR_BP1 == 8);
    CU_ASSERT(SR_BP2 == 0x10);
    CU_ASSERT(SR_SRWD == 0x80);
    CU_ASSERT(SR3_ADR == 0x01);

    CU_ASSERT(SCUR_4BYTE == 0x04);
}

void MACRO_SPIM_CTL0()
{
    uint8_t idBuf[3] = {0};
    SPIM_T *pSPIMModule = NULL;

    pSPIMModule = (SPIM_T *)GetSPIMModule(GetSPIMTestModuleIdx());
    //SPIM->KEY1 = SPIM_KEY_1;
    //SPIM->KEY2 = SPIM_KEY_2;

    /*
     *  SPIM_ENABLE_CIPHER()
     */
    SPIM_ENABLE_CIPHER(pSPIMModule);
    //printf("DESELTIM = %d\r\n", SPIM_GET_DMM_DESELTIM(pSPIMModule));
    CU_ASSERT_FALSE(pSPIMModule->CTL0 & SPIM_CTL0_CIPHOFF_Msk);
    CU_ASSERT(SPIM_GET_DMM_DESELTIM(pSPIMModule) == 18);

    /*
     *  SPIM_DISABLE_CIPHER()
     */
    SPIM_DISABLE_CIPHER(pSPIMModule);
    //printf("DESELTIM = %d\r\n", SPIM_GET_DMM_DESELTIM(pSPIMModule));
    CU_ASSERT_TRUE(pSPIMModule->CTL0 & SPIM_CTL0_CIPHOFF_Msk);
    CU_ASSERT(SPIM_GET_DMM_DESELTIM(pSPIMModule) == 8);

    /*
     *  SPIM_SET_BAL_EN(x)
     */
    pSPIMModule->CTL0 = 0;
    SPIM_ENABLE_BALEN(pSPIMModule);
    CU_ASSERT_TRUE(pSPIMModule->CTL0 & SPIM_CTL0_BALEN_Msk);
    SPIM_DISABLE_BALEN(pSPIMModule);
    CU_ASSERT_FALSE(pSPIMModule->CTL0 & SPIM_CTL0_BALEN_Msk);
    SPIM_ENABLE_BALEN(pSPIMModule);
    CU_ASSERT_TRUE(pSPIMModule->CTL0 & SPIM_CTL0_BALEN_Msk);

    /*
     *  SPIM_SET_OP_MODE(x)
     */
    SPIM_SET_OP_MODE(pSPIMModule, SPIM_OP_HYPER_MODE);
    CU_ASSERT_TRUE(pSPIMModule->CTL0 & SPIM_CTL0_HYPER_EN_Msk);
    SPIM_SET_OP_MODE(pSPIMModule, SPIM_OP_FLASH_MODE);
    CU_ASSERT_FALSE(pSPIMModule->CTL0 & SPIM_CTL0_HYPER_EN_Msk);

    /*
     *  _SPIM_SET_4BYTE_ADDR_EN(x)
     */
    pSPIMModule->CTL0 = 0;
    SPIM_SET_4BYTE_ADDR_EN(pSPIMModule, 1);
    CU_ASSERT_TRUE(pSPIMModule->CTL0 & SPIM_CTL0_B4ADDREN_Msk);
    CU_ASSERT_TRUE(SPIM_GET_4BYTE_ADDR_EN(pSPIMModule));

    SPIM_SET_4BYTE_ADDR_EN(pSPIMModule, 0);
    CU_ASSERT_FALSE(pSPIMModule->CTL0 & SPIM_CTL0_B4ADDREN_Msk);
    CU_ASSERT_FALSE(SPIM_GET_4BYTE_ADDR_EN(pSPIMModule));

    /*
     *  SPIM_ENABLE_INT()
     */
    SPIM_ENABLE_INT(pSPIMModule);
    CU_ASSERT(pSPIMModule->CTL0 & SPIM_CTL0_IEN_Msk);
    CU_ASSERT_TRUE(SPIM_GET_INT(pSPIMModule));
    //SPIM_ReadJedecId(pSPIMModule, idBuf, sizeof(idBuf), 1);

    SPIM_DISABLE_INT(pSPIMModule);
    CU_ASSERT_FALSE(pSPIMModule->CTL0 & SPIM_CTL0_IEN_Msk);
    CU_ASSERT_FALSE(SPIM_GET_INT(pSPIMModule));

    /*
     *  SPIM_SET_DATA_WIDTH()
     */
    pSPIMModule->CTL0 = 0;
    SPIM_SET_DATA_WIDTH(pSPIMModule, 8);
    CU_ASSERT(SPIM_GET_DATA_WIDTH(pSPIMModule) == 8);
    SPIM_SET_DATA_WIDTH(pSPIMModule, 16);
    CU_ASSERT(SPIM_GET_DATA_WIDTH(pSPIMModule) == 16);
    SPIM_SET_DATA_WIDTH(pSPIMModule, 24);
    CU_ASSERT(SPIM_GET_DATA_WIDTH(pSPIMModule) == 24);
    SPIM_SET_DATA_WIDTH(pSPIMModule, 32);
    CU_ASSERT(SPIM_GET_DATA_WIDTH(pSPIMModule) == 32);

    /*
     *  SPIM_SET_BURST_DATA()
     */
    pSPIMModule->CTL0 = 0;
    SPIM_SET_BURST_DATA(pSPIMModule, 1);
    CU_ASSERT(SPIM_GET_BURST_DATA(pSPIMModule) == 0x0);
    SPIM_SET_BURST_DATA(pSPIMModule, 2);
    CU_ASSERT(SPIM_GET_BURST_DATA(pSPIMModule) == 0x1);
    SPIM_SET_BURST_DATA(pSPIMModule, 3);
    CU_ASSERT(SPIM_GET_BURST_DATA(pSPIMModule) == 0x2);
    SPIM_SET_BURST_DATA(pSPIMModule, 4);
    CU_ASSERT(SPIM_GET_BURST_DATA(pSPIMModule) == 0x3);

    /*
     *  SPIM_ENABLE_SING_INPUT_MODE()
     */
    pSPIMModule->CTL0 = 0;
    SPIM_ENABLE_SING_INPUT_MODE(pSPIMModule);
    CU_ASSERT(pSPIMModule->CTL0 == (0 << SPIM_CTL0_BITMODE_Pos));

    /*
     *  SPIM_ENABLE_SING_OUTPUT_MODE()
     */
    pSPIMModule->CTL0 = 0;
    SPIM_ENABLE_SING_OUTPUT_MODE(pSPIMModule);
    CU_ASSERT(pSPIMModule->CTL0 == (SPIM_CTL0_QDIODIR_Msk | (0 << SPIM_CTL0_BITMODE_Pos)));

    /*
     *  SPIM_ENABLE_DUAL_INPUT_MODE()
     */
    pSPIMModule->CTL0 = 0;
    SPIM_ENABLE_DUAL_INPUT_MODE(pSPIMModule);
    CU_ASSERT(pSPIMModule->CTL0 == (0x1 << SPIM_CTL0_BITMODE_Pos));

    /*
     *  SPIM_ENABLE_DUAL_OUTPUT_MODE()
     */
    pSPIMModule->CTL0 = 0;
    SPIM_ENABLE_DUAL_OUTPUT_MODE(pSPIMModule);
    CU_ASSERT(pSPIMModule->CTL0 == (SPIM_CTL0_QDIODIR_Msk | (0x1 << SPIM_CTL0_BITMODE_Pos)));

