wosayttn/M55M1BSP/_CUnit/spim/spim_cunit.c
    /*
     *  SPIM_ENABLE_QUAD_INPUT_MODE()
     */
    pSPIMModule->CTL0 = 0;
    SPIM_ENABLE_QUAD_INPUT_MODE(pSPIMModule);
    CU_ASSERT(pSPIMModule->CTL0 == (0x2 << SPIM_CTL0_BITMODE_Pos));

    /*
     *  SPIM_ENABLE_QUAD_OUTPUT_MODE()
     */
    pSPIMModule->CTL0 = 0;
    SPIM_ENABLE_QUAD_OUTPUT_MODE(pSPIMModule);
    CU_ASSERT(pSPIMModule->CTL0 == (SPIM_CTL0_QDIODIR_Msk | (0x2 << SPIM_CTL0_BITMODE_Pos)));

    /*
     *  SPIM_ENABLE_OCTAL_INPUT_MODE()
     */
    pSPIMModule->CTL0 = 0;
    SPIM_ENABLE_OCTAL_INPUT_MODE(pSPIMModule);
    CU_ASSERT(pSPIMModule->CTL0 == (0x3 << SPIM_CTL0_BITMODE_Pos));

    /*
     *  SPIM_ENABLE_OCTAL_OUTPUT_MODE()
     */
    pSPIMModule->CTL0 = 0;
    SPIM_ENABLE_OCTAL_OUTPUT_MODE(pSPIMModule);
    CU_ASSERT(pSPIMModule->CTL0 == (SPIM_CTL0_QDIODIR_Msk | (0x3 << SPIM_CTL0_BITMODE_Pos)));

    /*
     *  _SPIM_SET_SUSP_INTVL()
     */
    pSPIMModule->CTL0 = 0;
    SPIM_SET_SUSP_INTVL(pSPIMModule, 0x3);
    CU_ASSERT(((pSPIMModule->CTL0 & SPIM_CTL0_SUSPITV_Msk) >> SPIM_CTL0_SUSPITV_Pos) == 0x3);
    SPIM_SET_SUSP_INTVL(pSPIMModule, 0x6);
    CU_ASSERT(((pSPIMModule->CTL0 & SPIM_CTL0_SUSPITV_Msk) >> SPIM_CTL0_SUSPITV_Pos) == 0x6);

    /*
     *  _SPIM_GET_SUSP_INTVL()
     */
    pSPIMModule->CTL0 = 0;
    SPIM_SET_SUSP_INTVL(pSPIMModule, 0x2);
    CU_ASSERT(SPIM_GET_SUSP_INTVL(pSPIMModule) == 0x2);
    SPIM_SET_SUSP_INTVL(pSPIMModule, 0x5);
    CU_ASSERT(SPIM_GET_SUSP_INTVL(pSPIMModule) == 0x5);

    /*
     *  SPIM_SET_OPMODE() / SPIM_GET_OP_MODE()
     */
    pSPIMModule->CTL0 = 0;
    SPIM_SET_OPMODE(pSPIMModule, SPIM_CTL0_OPMODE_IO);
    CU_ASSERT((pSPIMModule->CTL0 & SPIM_CTL0_OPMODE_Msk) == SPIM_CTL0_OPMODE_IO);
    SPIM_SET_OPMODE(pSPIMModule, SPIM_CTL0_OPMODE_PAGEWRITE);
    CU_ASSERT((pSPIMModule->CTL0 & SPIM_CTL0_OPMODE_Msk) == SPIM_CTL0_OPMODE_PAGEWRITE);
    SPIM_SET_OPMODE(pSPIMModule, SPIM_CTL0_OPMODE_PAGEREAD);
    CU_ASSERT((pSPIMModule->CTL0 & SPIM_CTL0_OPMODE_Msk) == SPIM_CTL0_OPMODE_PAGEREAD);
    SPIM_SET_OPMODE(pSPIMModule, SPIM_CTL0_OPMODE_DIRECTMAP);
    CU_ASSERT((pSPIMModule->CTL0 & SPIM_CTL0_OPMODE_Msk) == SPIM_CTL0_OPMODE_DIRECTMAP);

    /*
    *  SPIM_SET_DTR_MODE() / SPIM_GET_DTR_MODE()
    */
    pSPIMModule->CTL0 = 0;
    SPIM_SET_DTR_MODE(pSPIMModule, 1);
    CU_ASSERT_TRUE(SPIM_GET_DTR_MODE(pSPIMModule));
    SPIM_SET_DTR_MODE(pSPIMModule, 0);
    CU_ASSERT_FALSE(SPIM_GET_DTR_MODE(pSPIMModule));

    /*
    *  SPIM_SET_RDQS_MODE() / SPIM_GET_RDQS_MODE()
    */
    pSPIMModule->CTL0 = 0;
    SPIM_SET_RDQS_MODE(pSPIMModule, 1);
    CU_ASSERT(SPIM_GET_RDQS_MODE(pSPIMModule) == 1);
    SPIM_SET_RDQS_MODE(pSPIMModule, 0);
    CU_ASSERT(SPIM_GET_RDQS_MODE(pSPIMModule) == 0);

    /*
    *  SPIM_SET_RBO_MODE() / SPIM_GET_RBO_MODE()
    */
    pSPIMModule->CTL0 = 0;
    SPIM_SET_RBO_MODE(pSPIMModule, 1);
    CU_ASSERT(SPIM_GET_RBO_MODE(pSPIMModule) == 1);
    SPIM_SET_RBO_MODE(pSPIMModule, 0);
    CU_ASSERT(SPIM_GET_RBO_MODE(pSPIMModule) == 0);
}

void MACRO_SPIM_CTL1()
{
    SPIM_T *pSPIMModule = NULL;

    pSPIMModule = (SPIM_T *)GetSPIMModule(GetSPIMTestModuleIdx());
#if (SPIM_CACHE_EN == 1)
    /*
     *  SPIM_ENABLE_CACHE()
     */
    pSPIMModule->CTL1 = 0;
    SPIM_ENABLE_CACHE(pSPIMModule);
    CU_ASSERT_FALSE(pSPIMModule->CTL1 & SPIM_CTL1_CACHEOFF_Msk);

    /*
     *  _SPIM_DISABLE_CACHE()
     */
    pSPIMModule->CTL1 = 0;
    SPIM_DISABLE_CACHE(pSPIMModule);
    CU_ASSERT_TRUE(pSPIMModule->CTL1 & SPIM_CTL1_CACHEOFF_Msk);

    /*
     *  SPIM_IS_CACHE_EN()
     */
    pSPIMModule->CTL1 = 0;
    SPIM_ENABLE_CACHE(pSPIMModule);
    CU_ASSERT_TRUE(SPIM_IS_CACHE_EN(pSPIMModule));
    SPIM_DISABLE_CACHE();
    CU_ASSERT_FALSE(SPIM_IS_CACHE_EN(pSPIMModule));

    /*
     *  SPIM_INVALID_CACHE()
     */
    pSPIMModule->CTL1 = 0;
    SPIM_INVALID_CACHE(pSPIMModule);
    CU_ASSERT_TRUE((pSPIMModule->CTL1 & SPIM_CTL1_CDINVAL_Msk) == 1);

#endif //SPIM_CACHE_EN

    /*
     *  _SPIM_ENABLE_CCM()
     */
    //SPIM->CTL1 = 0;
    //_SPIM_ENABLE_CCM();
    //_SPIM_INVALID_CACHE();
    //CU_ASSERT_TRUE(SPIM->CTL1 & SPIM_CTL1_CCMEN_Msk);

    /*
     *  _SPIM_DISABLE_CCM()
     */
    //_SPIM_DISABLE_CCM();
    //CU_ASSERT_FALSE(SPIM->CTL1 & SPIM_CTL1_CCMEN_Msk);

    /*
     *  _SPIM_IS_CCM_EN()
     */
    //SPIM->CTL1 = 0;
    //_SPIM_ENABLE_CCM();
    //CU_ASSERT_TRUE(_SPIM_IS_CCM_EN());
    //_SPIM_DISABLE_CCM();
    //CU_ASSERT_FALSE(_SPIM_IS_CCM_EN());

    /*
     *  _SPIM_SET_SS_EN(x)
     */
    pSPIMModule->CTL1 = 0;
    SPIM_SET_SS_EN(pSPIMModule, 1);
    CU_ASSERT_FALSE(pSPIMModule->CTL1 & SPIM_CTL1_SS_Msk);
    SPIM_SET_SS_EN(pSPIMModule, 0);
    CU_ASSERT_TRUE(pSPIMModule->CTL1 & SPIM_CTL1_SS_Msk);

    /*
     *  _SPI_GET_SS_EN()
     */
    pSPIMModule->CTL1 = 0;
    SPIM_SET_SS_EN(pSPIMModule, 1);
    CU_ASSERT_TRUE(SPIM_GET_SS_EN(pSPIMModule));
    SPIM_SET_SS_EN(pSPIMModule, 0);
    CU_ASSERT_FALSE(SPIM_GET_SS_EN(pSPIMModule));

    /*
     *  _SPI_SET_SS_ACTLVL(x)
     */
    pSPIMModule->CTL1 = 0;
    SPIM_SET_SS_ACTLVL(pSPIMModule, 0);
    CU_ASSERT_FALSE(pSPIMModule->CTL1 & SPIM_CTL1_SSACTPOL_Msk);
    SPIM_SET_SS_ACTLVL(pSPIMModule, 1);
    CU_ASSERT_TRUE(pSPIMModule->CTL1 & SPIM_CTL1_SSACTPOL_Msk);

    /*
     *  SPIM_SET_IDL_INTVL()
     */
    pSPIMModule->CTL1 = 0;
    SPIM_SET_IDL_INTVL(pSPIMModule, 3);
    CU_ASSERT(((pSPIMModule->CTL1 & SPIM_CTL1_IDLETIME_Msk) >> SPIM_CTL1_IDLETIME_Pos) == 0x03);
    SPIM_SET_IDL_INTVL(pSPIMModule, 6);
    CU_ASSERT(((pSPIMModule->CTL1 & SPIM_CTL1_IDLETIME_Msk) >> SPIM_CTL1_IDLETIME_Pos) == 0x06);

    /*
     *  SPIM_GET_IDL_INTVL()
     */
    pSPIMModule->CTL1 = 0;
    SPIM_SET_IDL_INTVL(pSPIMModule, 2);
    CU_ASSERT(SPIM_GET_IDL_INTVL(pSPIMModule) == 0x02);
    SPIM_SET_IDL_INTVL(pSPIMModule, 4);
    CU_ASSERT(SPIM_GET_IDL_INTVL(pSPIMModule) == 0x04);

    /*
     *  SPIM_SET_CLOCK_DIVIDER(x)
     */
    pSPIMModule->CTL1 = 0;
    SPIM_SET_CLOCK_DIVIDER(pSPIMModule, 3);
    CU_ASSERT(((pSPIMModule->CTL1 & SPIM_CTL1_DIVIDER_Msk) >> SPIM_CTL1_DIVIDER_Pos) == 0x03);
    SPIM_SET_CLOCK_DIVIDER(pSPIMModule, 6);
    CU_ASSERT(((pSPIMModule->CTL1 & SPIM_CTL1_DIVIDER_Msk) >> SPIM_CTL1_DIVIDER_Pos) == 0x06);

