wosayttn/M55M1BSP/_CUnit/spim/spim_cunit.c
    /*
      *  SPIM_SET_PHDMAR_READ_DATA_WIDTH(x)
      */
    pSPIMModule->PHDMAR = 0;
    SPIM_SET_PHDMAR_READ_DATA_WIDTH(pSPIMModule, 0x1);
    CU_ASSERT(((pSPIMModule->PHDMAR & SPIM_PHDMAR_DW_MODE_Msk) >> SPIM_PHDMAR_DW_MODE_Pos) == 0x1);
    pSPIMModule->PHDMAR = 0;
    SPIM_SET_PHDMAR_READ_DATA_WIDTH(pSPIMModule, 0x2);
    CU_ASSERT(((pSPIMModule->PHDMAR & SPIM_PHDMAR_DW_MODE_Msk) >> SPIM_PHDMAR_DW_MODE_Pos) == 0x2);
    pSPIMModule->PHDMAR = 0;
    SPIM_SET_PHDMAR_READ_DATA_WIDTH(pSPIMModule, 0x3);
    CU_ASSERT(((pSPIMModule->PHDMAR & SPIM_PHDMAR_DW_MODE_Msk) >> SPIM_PHDMAR_DW_MODE_Pos) == 0x3);
    pSPIMModule->PHDMAR = 0;
    SPIM_SET_PHDMAR_READ_DATA_WIDTH(pSPIMModule, 0x4);
    CU_ASSERT(((pSPIMModule->PHDMAR & SPIM_PHDMAR_DW_MODE_Msk) >> SPIM_PHDMAR_DW_MODE_Pos) == 0x4);

    /*
     *  SPIM_ENABLE_PHDMAR_READ_DTR(x)/ SPIM_DISABLE_PHDMAR_READ_DTR(x)
     */
    pSPIMModule->PHDMAR = 0;
    SPIM_ENABLE_PHDMAR_READ_DTR(pSPIMModule);
    CU_ASSERT_TRUE(((pSPIMModule->PHDMAR & SPIM_PHDMAR_DTR_MODE_Msk) >> SPIM_PHDMAR_DTR_MODE_Pos));
    SPIM_DISABLE_PHDMAR_READ_DTR(pSPIMModule);
    CU_ASSERT_FALSE(((pSPIMModule->PHDMAR & SPIM_PHDMAR_DTR_MODE_Msk) >> SPIM_PHDMAR_DTR_MODE_Pos));

    /*
      *  SPIM_SET_PHDMAR_READ_BIT_MODE(x)
      */
    pSPIMModule->PHDMAR = 0;
    SPIM_SET_PHDMAR_READ_BIT_MODE(pSPIMModule, 0x1);
    CU_ASSERT(((pSPIMModule->PHDMAR & SPIM_PHDMAR_BM_MODE_Msk) >> SPIM_PHDMAR_BM_MODE_Pos) == 0x1);
    pSPIMModule->PHDMAR = 0;
    SPIM_SET_PHDMAR_READ_BIT_MODE(pSPIMModule, 0x2);
    CU_ASSERT(((pSPIMModule->PHDMAR & SPIM_PHDMAR_BM_MODE_Msk) >> SPIM_PHDMAR_BM_MODE_Pos) == 0x2);
    pSPIMModule->PHDMAR = 0;
    SPIM_SET_PHDMAR_READ_BIT_MODE(pSPIMModule, 0x3);
    CU_ASSERT(((pSPIMModule->PHDMAR & SPIM_PHDMAR_BM_MODE_Msk) >> SPIM_PHDMAR_BM_MODE_Pos) == 0x3);
    pSPIMModule->PHDMAR = 0;
    SPIM_SET_PHDMAR_READ_BIT_MODE(pSPIMModule, 0x4);
    CU_ASSERT(((pSPIMModule->PHDMAR & SPIM_PHDMAR_BM_MODE_Msk) >> SPIM_PHDMAR_BM_MODE_Pos) == 0x4);

    /*
     *  SPIM_ENABLE_PHDMAR_DATA_DTR(x)/ SPIM_DISABLE_PHDMAR_DATA_DTR(x)
     */
    pSPIMModule->PHDMAR = 0;
    SPIM_ENABLE_PHDMAR_DATA_DTR(pSPIMModule);
    CU_ASSERT_TRUE(((pSPIMModule->PHDMAR & SPIM_PHDMAR_DTR_DATA_Msk) >> SPIM_PHDMAR_DTR_DATA_Pos));
    SPIM_DISABLE_PHDMAR_DATA_DTR(pSPIMModule);
    CU_ASSERT_FALSE(((pSPIMModule->PHDMAR & SPIM_PHDMAR_DTR_DATA_Msk) >> SPIM_PHDMAR_DTR_DATA_Pos));

    /*
     *  SPIM_ENABLE_PHDMAR_DATA_RDQS(x)/ SPIM_DISABLE_PHDMAR_DATA_RDQS(x)
     */
    pSPIMModule->PHDMAR = 0;
    SPIM_ENABLE_PHDMAR_DATA_RDQS(pSPIMModule);
    CU_ASSERT_TRUE(((pSPIMModule->PHDMAR & SPIM_PHDMAR_RDQS_DATA_Msk) >> SPIM_PHDMAR_RDQS_DATA_Pos));
    SPIM_DISABLE_PHDMAR_DATA_RDQS(pSPIMModule);
    CU_ASSERT_FALSE(((pSPIMModule->PHDMAR & SPIM_PHDMAR_RDQS_DATA_Msk) >> SPIM_PHDMAR_RDQS_DATA_Pos));

    /*
      *  SPIM_SET_PHDMAR_RBO_DATA(x)
      */
    pSPIMModule->PHDMAR = 0;
    SPIM_SET_PHDMAR_RBO_DATA(pSPIMModule, 0x0);
    CU_ASSERT(((pSPIMModule->PHDMAR & SPIM_PHDMAR_RBO_DATA_Msk) >> SPIM_PHDMAR_RBO_DATA_Pos) == 0x0);
    pSPIMModule->PHDMAR = 0;
    SPIM_SET_PHDMAR_RBO_DATA(pSPIMModule, 0x1);
    CU_ASSERT(((pSPIMModule->PHDMAR & SPIM_PHDMAR_RBO_DATA_Msk) >> SPIM_PHDMAR_RBO_DATA_Pos) == 0x1);
    pSPIMModule->PHDMAR = 0;
    SPIM_SET_PHDMAR_RBO_DATA(pSPIMModule, 0x2);
    CU_ASSERT(((pSPIMModule->PHDMAR & SPIM_PHDMAR_RBO_DATA_Msk) >> SPIM_PHDMAR_RBO_DATA_Pos) == 0x2);
    pSPIMModule->PHDMAR = 0;
    SPIM_SET_PHDMAR_RBO_DATA(pSPIMModule, 0x3);
    CU_ASSERT(((pSPIMModule->PHDMAR & SPIM_PHDMAR_RBO_DATA_Msk) >> SPIM_PHDMAR_RBO_DATA_Pos) == 0x3);

    /*
      *  SPIM_SET_PHDMAR_DATA_BIT_MODE(x)
      */
    pSPIMModule->PHDMAR = 0;
    SPIM_SET_PHDMAR_DATA_BIT_MODE(pSPIMModule, 0x1);
    CU_ASSERT(((pSPIMModule->PHDMAR & SPIM_PHDMAR_BM_DATA_Msk) >> SPIM_PHDMAR_BM_DATA_Pos) == 0x1);
    pSPIMModule->PHDMAR = 0;
    SPIM_SET_PHDMAR_DATA_BIT_MODE(pSPIMModule, 0x2);
    CU_ASSERT(((pSPIMModule->PHDMAR & SPIM_PHDMAR_BM_DATA_Msk) >> SPIM_PHDMAR_BM_DATA_Pos) == 0x2);
    pSPIMModule->PHDMAR = 0;
    SPIM_SET_PHDMAR_DATA_BIT_MODE(pSPIMModule, 0x3);
    CU_ASSERT(((pSPIMModule->PHDMAR & SPIM_PHDMAR_BM_DATA_Msk) >> SPIM_PHDMAR_BM_DATA_Pos) == 0x3);
    pSPIMModule->PHDMAR = 0;
    SPIM_SET_PHDMAR_DATA_BIT_MODE(pSPIMModule, 0x4);
    CU_ASSERT(((pSPIMModule->PHDMAR & SPIM_PHDMAR_BM_DATA_Msk) >> SPIM_PHDMAR_BM_DATA_Pos) == 0x4);

    SPIM_CLEAR_PHDMAR(pSPIMModule);
    CU_ASSERT(pSPIMModule->PHDMAR == 0x0);

    CU_PASS();
}

void MACRO_SPIM_DMM_PHASE()
{
    SPIM_T *pSPIMModule = NULL;

    pSPIMModule = (SPIM_T *)GetSPIMModule(GetSPIMTestModuleIdx());
    /*
     *  SPIM_SET_PHDMM_CMD_WIDTH(x)
     */
    pSPIMModule->PHDMM = 0;
    SPIM_SET_PHDMM_CMD_WIDTH(pSPIMModule, 0x1);
    CU_ASSERT(((pSPIMModule->PHDMM & SPIM_PHDMM_DW_CMD_Msk) >> SPIM_PHDMM_DW_CMD_Pos) == 0x1);
    pSPIMModule->PHDMM = 0;
    SPIM_SET_PHDMM_CMD_WIDTH(pSPIMModule, 0x2);
    CU_ASSERT(((pSPIMModule->PHDMM & SPIM_PHDMM_DW_CMD_Msk) >> SPIM_PHDMM_DW_CMD_Pos) == 0x2);
    pSPIMModule->PHDMM = 0;
    SPIM_SET_PHDMM_CMD_WIDTH(pSPIMModule, 0x3);
    CU_ASSERT(((pSPIMModule->PHDMM & SPIM_PHDMM_DW_CMD_Msk) >> SPIM_PHDMM_DW_CMD_Pos) == 0x3);
    pSPIMModule->PHDMM = 0;
    SPIM_SET_PHDMM_CMD_WIDTH(pSPIMModule, 0x4);
    CU_ASSERT(((pSPIMModule->PHDMM & SPIM_PHDMM_DW_CMD_Msk) >> SPIM_PHDMM_DW_CMD_Pos) == 0x4);

    /*
     *  SPIM_ENABLE_PHDMM_CMD_DTR(x)/ SPIM_DISABLE_PHDMM_CMD_DTR(x)
     */
    pSPIMModule->PHDMM = 0;
    SPIM_ENABLE_PHDMM_CMD_DTR(pSPIMModule);
    CU_ASSERT_TRUE(((pSPIMModule->PHDMM & SPIM_PHDMM_DTR_CMD_Msk) >> SPIM_PHDMM_DTR_CMD_Pos));
    SPIM_DISABLE_PHDMM_CMD_DTR(pSPIMModule);
    CU_ASSERT_FALSE(((pSPIMModule->PHDMM & SPIM_PHDMM_DTR_CMD_Msk) >> SPIM_PHDMM_DTR_CMD_Pos));

    /*
      *  SPIM_SET_PHDMM_CMD_BIT_MODE(x)
      */
    pSPIMModule->PHDMM = 0;
    SPIM_SET_PHDMM_CMD_BIT_MODE(pSPIMModule, 0x1);
    CU_ASSERT(((pSPIMModule->PHDMM & SPIM_PHDMM_BM_CMD_Msk) >> SPIM_PHDMM_BM_CMD_Pos) == 0x1);
    pSPIMModule->PHDMM = 0;
    SPIM_SET_PHDMM_CMD_BIT_MODE(pSPIMModule, 0x2);
    CU_ASSERT(((pSPIMModule->PHDMM & SPIM_PHDMM_BM_CMD_Msk) >> SPIM_PHDMM_BM_CMD_Pos) == 0x2);
    pSPIMModule->PHDMM = 0;
    SPIM_SET_PHDMM_CMD_BIT_MODE(pSPIMModule, 0x3);
    CU_ASSERT(((pSPIMModule->PHDMM & SPIM_PHDMM_BM_CMD_Msk) >> SPIM_PHDMM_BM_CMD_Pos) == 0x3);
    pSPIMModule->PHDMM = 0;
    SPIM_SET_PHDMM_CMD_BIT_MODE(pSPIMModule, 0x4);
    CU_ASSERT(((pSPIMModule->PHDMM & SPIM_PHDMM_BM_CMD_Msk) >> SPIM_PHDMM_BM_CMD_Pos) == 0x4);

