wosayttn/M55M1BSP/_CUnit/spim/spim_cunit.c
        pData = (uint32_t *)u8TstBuf1;

        for (i = 0; i < BUFFER_SIZE; i += 4, pData++)
        {
            if (*pData != 0xFFFFFFFF)
            {
                printf("FAILED!\n");
                printf("Erase DMA R/W - Flash address 0x%x, read 0x%x!\n", i, *pData);
                return -1;
            }
        }
    }

    /*
     *  Program data to flash block
     */
    popDat(u8TstBuf1, BUFFER_SIZE);

    for (offset = 0; offset < FLASH_BLOCK_SIZE; offset += BUFFER_SIZE)
    {
        //SPIM_DMA_Write(spim, offset, is4ByteAddr, BUFFER_SIZE, u8TstBuf1, WrCmd);
        SPIM_DMA_WritePhase(spim,
                            &gWB_02h_WrCMD,
                            is4ByteAddr,
                            offset,
                            BUFFER_SIZE,
                            u8TstBuf1);
    }

    //printf("pSPIMx->PHDMAW = 0x%08X\r\n", spim->PHDMAW);
    CU_ASSERT(spim->PHDMAW == 0x00000301);

    /*
     *  Verify flash block data
     */

    SPIM_DMADMM_InitPhase(spim, &gWB_EBh_RdCMD, SPIM_CTL0_OPMODE_PAGEREAD);

    popDat(u8TstBuf1, BUFFER_SIZE);

    for (offset = 0; offset < FLASH_BLOCK_SIZE; offset += BUFFER_SIZE)
    {
        memset(u8TstBuf2, 0, BUFFER_SIZE);
        SPIM_DMADMM_InitPhase(spim, &gWB_EBh_RdCMD, SPIM_CTL0_OPMODE_PAGEREAD);

        SPIM_DMA_Read(spim, offset, is4ByteAddr, BUFFER_SIZE, u8TstBuf2, gWB_EBh_RdCMD.u32CMDCode, 1);

        //SPIM_DMA_ReadPhase(spim,
        //                   &gWB_EBh_RdCMD,
        //                   is4ByteAddr,
        //                   offset,
        //                   BUFFER_SIZE,
        //                   u8TstBuf2,
        //                   1);

        //printf("pSPIMx->PHDMAR = 0x%08X\r\n", spim->PHDMAR);
        CU_ASSERT(spim->PHDMAR == 0x20212301);

        // Compare.
        if (memcmp(u8TstBuf1, u8TstBuf2, BUFFER_SIZE))
        {
            printf("FAILED!\n");
            dump_compare_error(offset, u8TstBuf1, u8TstBuf2, BUFFER_SIZE);
            CU_FAIL();
            return -1;
        }
    }

    SPIM_SetQuadEnable(spim, 1, 0);

    printf("done.\n");
    return 0;
}

void SPIM_Basic_Func()
{
    SPIM_T *pSPIMModule = NULL;

    pSPIMModule = (SPIM_T *)GetSPIMModule(GetSPIMTestModuleIdx());

    if (SPIM_InitFlash(pSPIMModule, 1) != 0)        /* Initialized SPI flash */
    {
        printf("SPIM flash initialize failed!\n");
        CU_FAIL();
    }

    SPIM_ReadJedecId(pSPIMModule, idBuf, sizeof(idBuf), 1, 0, 0);
    printf("SPIM get JEDEC ID=0x%02X, 0x%02X, 0x%02X\n", idBuf[0], idBuf[1], idBuf[2]);

    if ((idBuf[0] != MFGID_WINBOND) &&
            (idBuf[0] != MFGID_MXIC) &&
            (idBuf[0] != MFGID_EON) &&
            (idBuf[0] != MFGID_ISSI) &&
            (idBuf[0] != MFGID_SPANSION) &&
            (idBuf[0] != MFGID_MICRON))
    {
        CU_FAIL();
    }
    else
    {
        CU_PASS();
    }
}

void SPIM_DMA_Func()
{
    SPIM_T *pSPIMModule = NULL;

    pSPIMModule = (SPIM_T *)GetSPIMModule(GetSPIMTestModuleIdx());

    if (SPIM_InitFlash(pSPIMModule, 1) != 0)        /* Initialized SPI flash */
    {
        printf("SPIM flash initialize failed!\n");
        CU_FAIL();
    }

    if (dma_read_write(pSPIMModule, 0) < 0)
    {
        printf("dma_read_write FAILED!!\n");
        CU_FAIL();
    }

    CU_PASS();
}

void SPIM_Chip_Erase_Func()
{
    int        i, offset;
    uint32_t   *pData;
    SPIM_T *pSPIMModule = NULL;
    uint8_t *u8TstBuf1 = (uint8_t *)GetTestBuffer1();

    pSPIMModule = (SPIM_T *)GetSPIMModule(GetSPIMTestModuleIdx());

    SPIM_SET_CLOCK_DIVIDER(pSPIMModule, 10);       /* Set SPIM clock as HCLK divided by 2 */

    //SPIM_SET_DCNUM(pSPIMModule, 8);                /* 8 is the default value. */

    if (SPIM_InitFlash(pSPIMModule, 1) != 0)        /* Initialized SPI flash */
    {
        printf("SPIM flash initialize failed!\n");
        CU_FAIL();
    }

    if (dma_read_write(pSPIMModule, 0) < 0)
    {
        printf("dma_read_write FAILED!!\n");
        CU_FAIL();
    }

    printf("Doing Chip Erase...\n");
    SPIM_ChipErase(pSPIMModule, 1, 1);
    printf("Chip Erase done.\n");

    /*
     *  Verify flash page be erased
     */
    for (offset = 0; offset < FLASH_BLOCK_SIZE; offset += BUFFER_SIZE)
    {
        memset(u8TstBuf1, 0, BUFFER_SIZE);
        SPIM_DMA_Read(pSPIMModule, offset, 0, BUFFER_SIZE, u8TstBuf1, CMD_DMA_FAST_READ, 1);

        pData = (uint32_t *)u8TstBuf1;

        for (i = 0; i < BUFFER_SIZE; i += 4, pData++)
        {
            if (*pData != 0xFFFFFFFF)
            {
                printf("FAILED!\n");
                printf("Chip Erase - Flash address 0x%x, read 0x%x!\n", i, *pData);
                CU_FAIL();
            }
        }
    }

    printf("DMA Test done.\n");
    CU_PASS();
}

void SPIM_IO_WriteFunc()
{
    uint32_t offset = 0;
    SPIM_T *pSPIMModule = NULL;
    uint8_t *u8TstBuf1 = (uint8_t *)GetTestBuffer1();

    pSPIMModule = (SPIM_T *)GetSPIMModule(GetSPIMTestModuleIdx());

    SPIM_SetQuadEnable(pSPIMModule, 1, 1);

    /*
     *  Program data to flash block
     */
    for (offset = 0; offset < FLASH_BLOCK_SIZE; offset += BUFFER_SIZE)
    {
        popDat(u8TstBuf1, BUFFER_SIZE);

        SPIM_IO_Write(pSPIMModule,
                      offset,
                      0,
                      BUFFER_SIZE,
                      u8TstBuf1,
                      CMD_QUAD_PAGE_PROGRAM_WINBOND,
                      1,
                      1,
                      4,
                      0);
        //SPIM_IO_Write(pSPIMModule, offset, 0, BUFFER_SIZE, g_buff, OPCODE_PP, 1, 1, 1);
    }

    SPIM_SetQuadEnable(pSPIMModule, 0, 1);
}

void SPIM_IO_RW_Func()
{
    int        i, offset;
    uint32_t   *pData;
    SPIM_T *pSPIMModule = NULL;
    uint8_t *u8TstBuf1 = (uint8_t *)GetTestBuffer1();
    uint8_t *u8TstBuf2 = (uint8_t *)GetTestBuffer2();

    pSPIMModule = (SPIM_T *)GetSPIMModule(GetSPIMTestModuleIdx());

    //SPIM_SET_CLOCK_DIVIDER(pSPIMModule, 10);       /* Set SPIM clock as HCLK divided by 4 */

    if (SPIM_InitFlash(pSPIMModule, 1) != 0)        /* Initialized SPI flash */
    {
        printf("SPIM flash initialize failed!\n");
        CU_FAIL();
    }

    SPIM_Enable_4Bytes_Mode(pSPIMModule, 0, 1, 0);

