wosayttn/M55M1BSP/_CUnit/spim/spim_cunit.c
    CU_ASSERT(SPIM_Is4ByteModeEnable(pSPIMModule, 1) == 0);

    /*
     *  Erase flash page
     */
    //SPIM_EraseBlock(pSPIMModule, 0, 0, OPCODE_BE_64K, 1, 1);
    SPIM_EraseAddrRange(pSPIMModule, 0, 0, FLASH_BLOCK_SIZE, OPCODE_BE_64K, FLASH_BLOCK_SIZE, 1);

    SPIM_SetQuadEnable(pSPIMModule, 1, 1);

    /*
     *  Verify flash page be erased
     */
    for (offset = 0; offset < FLASH_BLOCK_SIZE; offset += BUFFER_SIZE)
    {
        memset(u8TstBuf1, 0, BUFFER_SIZE);
        //SPIM_IO_Read(pSPIMModule, offset, 0, BUFFER_SIZE, u8TstBuf1, 0xeb, 1, 4, 4, 3, 0);
        SPIM_IO_SendCMDPhase(pSPIMModule, SPIM_IO_READ_PHASE, 0xEB, PHASE_NORMAL_MODE, 0);
        SPIM_IO_SendAddrPhase(pSPIMModule, 0, offset, PHASE_QUAD_MODE, 0);
        SPIM_IO_SendDummyCycle(pSPIMModule, 4);
        SPIM_IO_SendDataPhase(pSPIMModule, SPIM_IO_READ_PHASE, u8TstBuf1, BUFFER_SIZE, PHASE_QUAD_MODE, 0);
        //SPIM_Phase_IORead(pSPIMModule, &gWB_EDh_RdCMD, offset, 0, u8TstBuf1, BUFFER_SIZE);

        pData = (uint32_t *)u8TstBuf1;

        for (i = 0; i < BUFFER_SIZE; i += 4, pData++)
        {
            if (*pData != 0xFFFFFFFF)
            {
                printf("Erase FAILED!\n");
                printf("Erase I/O RW - Flash address 0x%x, read 0x%x!\n", i, *pData);
                CU_FAIL();
            }
        }
    }

    /*
     *  Program data to flash block
     */
    for (offset = 0; offset < FLASH_BLOCK_SIZE; offset += BUFFER_SIZE)
    {
        popDat(u8TstBuf1, BUFFER_SIZE);
        //pData = (uint32_t *)u8TstBuf1;

        //for (i = 0; i < BUFFER_SIZE; i += 4, pData++)
        //    * pData = (i << 16) | (offset + i);

        //SPIM_IO_Write(pSPIMModule,
        //              offset,
        //              0,
        //              BUFFER_SIZE,
        //              u8TstBuf1,
        //              CMD_QUAD_PAGE_PROGRAM_WINBOND,
        //              1,
        //              1,
        //              4,
        //              0);
        SPIM_IO_WritePhase(pSPIMModule,
                           &gWB_02h_WrCMD,
                           offset,
                           0,
                           u8TstBuf1,
                           BUFFER_SIZE);
        //SPIM_IO_Write(pSPIMModule, offset, 0, BUFFER_SIZE, g_buff, OPCODE_PP, 1, 1, 1);
    }

    popDat(u8TstBuf1, BUFFER_SIZE);

    /*
     *  Read and compare flash data
     */
    for (offset = 0; offset < FLASH_BLOCK_SIZE; offset += BUFFER_SIZE)
    {
        memset(u8TstBuf2, 0, BUFFER_SIZE);
        //SPIM_IO_Read(pSPIMModule, offset, 0, BUFFER_SIZE, u8TstBuf2, 0xeb, 1, 4, 4, 3, 0);
        SPIM_IO_ReadPhase(pSPIMModule, &gWB_EDh_RdCMD, offset, 0, u8TstBuf2, BUFFER_SIZE);
        //SPIM_IO_SendCMDPhase(pSPIMModule, SPIM_IO_READ_PHASE, 0xEB, PHASE_NORMAL_MODE, 0);
        //SPIM_IO_SendAddrPhase(pSPIMModule, 0, offset, PHASE_QUAD_MODE, 0);
        //SPIM_IO_DCPhase(pSPIMModule, 2, PHASE_QUAD_MODE, 0);
        //SPIM_IO_SendDummyCycle(pSPIMx, 4);
        //SPIM_IO_SendDataPhase(pSPIMModule, SPIM_IO_WRITE_PHASE, u8TstBuf2, BUFFER_SIZE, PHASE_QUAD_MODE, 0);

        // Compare.
        if (memcmp(u8TstBuf1, u8TstBuf2, BUFFER_SIZE))
        {
            printf("FAILED!\n");
            //dump_compare_error(offset, u8TstBuf1, u8TstBuf2, BUFFER_SIZE);
            CU_FAIL();
        }
    }

    SPIM_SetQuadEnable(pSPIMModule, 0, 1);

    printf("IO Test done.\n");
    CU_PASS();
}

void SPIM_DMM_Func()
{
    int        i, offset;
    uint32_t   *pData;
    SPIM_T *pSPIMModule = NULL;
    uint32_t u32DMMAddress = 0;
    uint8_t *u8TstBuf1 = (uint8_t *)GetTestBuffer1();
    uint8_t *u8TstBuf2 = (uint8_t *)GetTestBuffer2();

    pSPIMModule = (SPIM_T *)GetSPIMModule(GetSPIMTestModuleIdx());

    if (SPIM_InitFlash(pSPIMModule, 1) != 0)        /* Initialized SPI flash */
    {
        printf("SPIM flash initialize failed!\n");
        CU_FAIL();
    }

    SPIM_IO_WriteFunc();

    SPIM_SetQuadEnable(pSPIMModule, 1, 1);

    SPIM_DMM_ReadPhase(pSPIMModule, &gWB_EBh_RdCMD, 0, 0);
    printf("pSPIMx->PHDMM = 0x%08X\r\n", pSPIMModule->PHDMM);

    CU_ASSERT(pSPIMModule->PHDMM == 0x20212301);

    for (offset = 0; offset < FLASH_BLOCK_SIZE; offset += BUFFER_SIZE)
    {
        if (GetSPIMTestModuleIdx() == C_SPIM0)
        {
            u32DMMAddress = SPIM0_DMM_MAP_ADDR;
        }
        else if (GetSPIMTestModuleIdx() == C_SPIM1)
        {
            u32DMMAddress = SPIM1_DMM_MAP_ADDR;
        }

        memcpy(u8TstBuf1, (uint8_t *)(u32DMMAddress + offset), BUFFER_SIZE);

        popDat(u8TstBuf1, BUFFER_SIZE);

        pData = (uint32_t *)u8TstBuf1;

        for (i = 0; i < BUFFER_SIZE; i += 4, pData++)
        {
            if (inpw(u32DMMAddress + offset + i) != *pData)
            {
                printf("FAILED!\n");
                printf("DMM - Flash address 0x%x, read 0x%x, expect 0x%x!\n",
                       i,
                       *pData,
                       (i << 16) | (offset + i));
                SPIM_ExitDirectMapMode(pSPIMModule);
                CU_FAIL();
            }
        }
    }

    SPIM_ExitDirectMapMode(pSPIMModule);

    SPIM_SetQuadEnable(pSPIMModule, 0, 1);

    printf("DMM Test done.\n");
    CU_PASS();
}

CU_TestInfo SPIM_ConstantTests[] =
{
    {"SPIM CONST Address", SPIM_Const_Address},
    {"SPIM CONST SPIM_CTL0", SPIM_Const_SPIM_CTL0},
    {"SPIM CONST SPIM_CMDCODE", SPIM_Const_SPIM_CMDCODE},
    {"SPIM CONST SPIM_PHASE", SPIM_Const_SPIM_PHASE},
    {"SPIM CONST MFGID", SPIM_Const_MFGID},
    {"SPIM CONST OPCODE", SPIM_Const_OPCODE},
    {"SPIM CONST Register", SPIM_Const_Register},
    CU_TEST_INFO_NULL
};

CU_TestInfo SPIM_MacroTests[] =
{
    {"SPIM_CTL0 Macros", MACRO_SPIM_CTL0},
    {"SPIM_CTL1 Macros", MACRO_SPIM_CTL1},
    {"SPIM_RXCLKDLY Macros", MACRO_SPIM_RXCLKDLY},
    {"SPIM_DMMCTL Macros", MACRO_SPIM_DMMCTL},
    {"SPIM_CTL2 Macros", MACRO_SPIM_CTL2},
    {"SPIM_PHDMAW Macros", MACRO_SPIM_DMA_WRITE_PHASE},
    {"SPIM_PHDMAR Macros", MACRO_SPIM_DMA_READ_PHASE},
    {"SPIM_PHDMM Macros", MACRO_SPIM_DMM_PHASE},
    {"SPIM_DLL0 Macros", MACRO_SPIM_DLL0},
    {"SPIM_DLL1 Macros", MACRO_SPIM_DLL1},
    {"SPIM_DLL2 Macros", MACRO_SPIM_DLL2},
    {"SPIM_GetSClkFreq Macros", MACRO_SPIM_GetSClkFreq},
    CU_TEST_INFO_NULL,
};

CU_TestInfo SPIM_ApiTests[] =
{
    {"SPIM Init/Read ID Function", SPIM_Basic_Func},
    {"SPIM DMA Function", SPIM_DMA_Func},
    {"SPIM I/O Read/Write Function", SPIM_IO_RW_Func},
    {"SPIM DMM Function", SPIM_DMM_Func},
    //   {"SPIM Chip Erase", SPIM_Chip_Erase_Func},
    CU_TEST_INFO_NULL
};


CU_SuiteInfo suites[] =
{
    //{"SPIM CONST", SPIM_Tests_Init, SPIM_Tests_Clean, NULL, NULL, SPIM_ConstantTests},
    //{"SPIM MACRO", SPIM_Tests_Init, SPIM_Tests_Clean, NULL, NULL, SPIM_MacroTests},
    {"SPIM API", SPIM_Tests_Init, SPIM_Tests_Clean, NULL, NULL, SPIM_ApiTests},

    CU_SUITE_INFO_NULL,
};
